lisp/my-emacs.org
#+TITLE: My Emacs
#+PROPERTY: header-args:elisp :results silent :tangle my-emacs.el
#+AUTO_TANGLE: t

* Repeatize keymaps
https://karthinks.com/software/it-bears-repeating/

#+begin_src elisp
  (defun repeatize (keymap)
    "Add `repeat-mode' support to a KEYMAP."
    (map-keymap
     (lambda (_key cmd)
       (when (symbolp cmd)
         (put cmd 'repeat-map keymap)))
     (symbol-value keymap)))
#+end_src

* Repeat-maps
** Tab bar history
#+begin_src elisp
  (defvar-keymap tab-bar-history-repeat-map
    :repeat t
    "<left>" #'tab-bar-history-back
    "<right>" #'tab-bar-history-forward)
#+end_src

** Horizontal scroll
#+begin_src elisp
  (defvar-keymap horizontal-scroll-repeat-map
    :repeat t
    ">" #'scroll-right
    "<" #'scroll-left)
#+end_src

* Split windows sensibly
=split-window-sensibly= first tries to split window vertically (one above the other), and if it can't, then
horizontally. I want to have it the other way around - first horizontally, then vertically.

Copied from https://emacs.stackexchange.com/a/33756

#+begin_src elisp
  (defun my-split-window-sensibly (&optional window)
      (interactive)
      (let ((window (or window (selected-window))))
          (or (and (window-splittable-p window t)
                   (with-selected-window window
                       (split-window-right)))
              (and (window-splittable-p window)
                   (with-selected-window window
                       (split-window-below))))))

  (setq split-window-preferred-function #'my-split-window-sensibly)
#+end_src

* Provide
#+begin_src elisp
  (provide 'my-emacs)
#+end_src

* Local variables :noexport:
# Local Variables:
# jinx-local-words: "Repeatize keymaps"
# End:
